person = {
    "name": "kim",
    "age": 20,
    "job": "student"
}

################################################################################################################

print(person["name"])  # 값 가져오기
# 출력: kim
len(person)    # 딕셔너리 길이

################################################################################################################

person["age"] = 21      # 수정
person["city"] = "seoul" # 추가

del person["age"]    # 키 삭제

################################################################################################################

for key in person:    # key 반복문 돌리기        for key in person.keys() 랑 똑같음
    print(key)

for value in person.values():    # value 반복문 돌리기
    print(value)

for key, value in person.items():    # key, value 둘다
    print(key, value)

################################################################################################################

if "name" in person:    # key 존재 확인
    print("있음")

################################################################################################################

### 안전하게 값 가져오기 ###
dict.get(key)
print(person.get("phone"))    # 없는 키면 None 반환
print(person.get("phone", "없음"))

################################################################################################################

for key in sorted(count):    # key 기준 딕셔너리 정렬
    print(key, count[key])

################################################################################################################

###   리스트 + 딕셔너리   ###
students = [
    {"name": "kim", "score": 90},
    {"name": "lee", "score": 80}
]

print(students[0]["name"])

