a = [1, 2, '삼', 'four']
b = ['BTS', '봉준호', '손흥민', '제이팍', 'Let`s go']

print(a[0])
print(a[0:2])
print('삼' in a)
print(len(a))

a[2] = '석삼'
print(a)

a.append('다섯')    # 값 추가
print(a)

a.remove(2)    # 값 삭제
print(a)

a.extend(b)     # 리스트 확장
print(a)

.split()     # 문자열 분리
.strip()     # 문자열 양쪽(앞뒤)의 공백을 제거

# insert()      # 원하는 위치에 값 추가
# pop()         # 원하는 위치 의 값 삭제
# clear()       # 모든 값 삭제
# sort()        # 값 순서대로 정렬렬  
# reverse()     # 순서 뒤집기
# copy()        # 리스트 복사
# count()       # 어떤 값이 몇 개 있는지
# index()       # 어떤 값이 어디에 있는지

########################################################################################

# 딱 N개만 사용하기
lst = list(map(int, input().split()))[:N]

########################################################################################

# 문자열 붙여서
print(list(reversed(nums)))
'구분자'.join(리스트)

########################################################################################

# 거꾸로
A = "apple orange banana"
print(*A.split()[::-1])

########################################################################################

# 입력받은거 리스트로
A = list(map(int, input().split()))
print(A)

########################################################################################

# 리스트의 앞에서 N개만 남기고 나머지 버리기
N = int(input())
lst = list(map(int, input().split()))
lst = lst[:N]

print(lst)

#### 출력 #### 
# 1 2 3 4 5
# [1, 2, 3]

########################################################################################

# 반복문으로 정확히 N개만 받기
while len(lst) < N:
    lst.extend(map(int, input().split()))


########################################################################################

# 리스트 컴프리헨션
[ 표현식 for 항목 in 반복가능객체 (if 조건문) ]
example = [i * 2 for i in range(1, 6)]
example2 = [x for x in range(1, 10+1) if x % 2 == 0]
# 결과: [2, 4, 6, 8, 10]

########################################################################################

#<리스트 더하기>#

A = [1, 2, 3]
B = [4, 5]

# 1. 연산자 사용
C = A + B


# 2. A의 복사본을 C로 만들고 B를 추가
C = list(A) 
C.extend(B)


# 3. 리스트 안에서 바로 언패킹
C = [*A, *B]


# 리스트 반복
print(B*3)


# 리스트 + 문자열
D = input().split()

print(D)

print(D + D[1:3] + [D[1]])      # C[1]은 문자열이라 []로 한번 더 감싸줘야 함


########################################################################################

# n만큼 잘라서 리슽트에 저장
def solution(my_str, n):
    return [my_str[i:i+n] for i in range(0, len(my_str), n)]
