# 문자열 콤마로 분리하여 출력 #

# 방법1

inp = input()
print(*inp, sep=",")

################################################################################################################

#방법2

inp = input()
print(",".join(inp))

################################################################################################################

# 문자열 myString이 주어진다. 
# "x"를 기준으로 해당 문자열을 잘라내 배열을 만든 후 사전순으로 정렬한 배열을 return

def solution(myString):
    return sorted([s for s in myString.split("x") if s])    # if s != ""

