########################################################################################

print(f"{h:02d}:{m:02d}")

########################################################################################

pi = 3.141592
print(f"결과: {pi:.2f}")  # 출력: 3.14

########################################################################################

문자열.replace(바꿀값, 새값) # 바꿀값, 새값 모두 문자열 형태여야 한다. 문자열끼리만 바꿀 수 있다.

예)
numbers = onetwothreefourfivesixseveneightnine
num_list = ["zero", "one", "two", "three", "four",
                "five", "six", "seven", "eight", "nine"]

for i in range(10):
    numbers = numbers.replace(num_list[i], str(i))
return int(numbers)


########################################################################################

'''숫자도 문자열로 바꾸면 하나씩 꺼내서 다룰 수 있따!'''
k = 1;  count = 0
for num in range(11, 16):
    for n in str(num):
        if n == str(k):
            count += 1
# 11부터 16까지 1이 들어있는 개수를 센다.



########################################################################################
