X = int(input())


for x in range(1, X+1):
    for y in range(1, X+1):
        print(f'{x}/{y}', end=' ')
    print()



   
1/1 (1)     1/2 (2)     1/3 (6)     1/4 (7)       1/5 (15)


2/1 (3)     2/2 (5)     2/3 (8)     2/4 (14)      2/5


3/1 (4)     3/2 (9)     3/3 (13)    3/4           3/5


4/1 (10)    4/2 (12)    4/3         4/4           4/5


5/1 (11)    5/2         5/3         5/4           5/5



right 1 -> left down 1 -> down 1 -> right up 2
right 1 -> left down 3 -> down 1 -> right up 4


a = 1; b = 1;       # 첫번째

b+1  ->  (a+1, b-1) X 1  ->  a+1  ->  (a-1,b+1) X 2     # 6번째     
b+1  ->  (a+1, b-1) X 3  ->  a+1  ->  (a-1,b+1) X 4     # 15번째    9
b+1  ->  (a+1, b-1) X 5  ->  a+1  ->  (a-1,b+1) X 6     # 28번째    13
b+1  ->  (a+1, b-1) X 7  ->  a+1  ->  (a-1,b+1) X 8     # 45번째    17
b+1  ->  (a+1, b-1) X 9  ->  a+1  ->  (a-1,b+1) X 10    # 66번째    21

a_count = 0
b_count = 0

while True:
    
    if X == 1:
        print("1/1")
    
    b += 1
    
    for i in range():
        a+=1; b-=1
        


    





1/1     1
1/2     2
2/1     3
3/1     4
2/2     5
1/3     6
1/4     7
2/3     8
3/2     9
4/1     10
5/1     11
4/2     12
3/3     13
2/4     14
1/5     15
