# 2줄을 입력받아 리스트에 저장
inputs = [input() for _ in range(2)]

name = inputs[0]
age = inputs[1]

print(f"{name} is {age} years old.")

############################################################################################################

io = []
for _ in range(2):
    io.extend(input().split())

############################################################################################################

# 입력: [['Minsu', '15'], ['Kayoung', '13']] 의 2중 리스트 형태가 됨
io = [input().split() for _ in range(2)]

# 나이는 계산을 위해 정수(int)로 변환
age_diff = int(io[0][1]) - int(io[1][1])

# 출력 예시와 맞추기
print(f"{io[0][0]}'s age - {io[1][0]}'s age = {age_diff}")


############################################################################################################
